package variable

const (
	GRID_WIDTH = 40
	COLUMN     = 15
	ROW        = 15
	RATIO      = 1 // 进攻系数，大于1为进攻型，小于1位防守型
	DEPTH      = 2 // 搜索深度
)

type shapeScore struct {
	score int
	shape []int
}

// 棋盘的评估分数
var (
	ShapeScoreList = []shapeScore{
		{50, []int{0, 1, 1, 0, 0}},
		{50, []int{0, 0, 1, 1, 0}},
		{200, []int{1, 1, 0, 1, 0}},
		{500, []int{0, 0, 1, 1, 1}},
		{500, []int{1, 1, 1, 0, 0}},
		{5000, []int{0, 1, 1, 1, 0}},
		{5000, []int{0, 1, 0, 1, 1, 0}},
		{5000, []int{0, 1, 1, 0, 1, 0}},
		{5000, []int{1, 1, 1, 0, 1}},
		{5000, []int{1, 1, 0, 1, 1}},
		{5000, []int{1, 0, 1, 1, 1}},
		{5000, []int{0, 1, 1, 1, 1}},
		{50000, []int{0, 1, 1, 1, 1, 0}},
		{9999999, []int{1, 1, 1, 1, 1}},
	}
)
