package variable

import "math"

const (
	GRID_WIDTH = 40
	COLUMN     = 15
	ROW        = 15
	RATIO      = 1 // 进攻系数，大于1为进攻型，小于1位防守型
	DEPTH      = 2 // 搜索深度
)

// 棋盘的评估分数
var (
	// 用[5]int就可以表示的局势
	ShapeScoreList5 = map[[5]int]int{
		{0, 1, 1, 0, 0}: 50,
		{0, 0, 1, 1, 0}: 50,
		{1, 1, 0, 1, 0}: 200,
		{0, 0, 1, 1, 1}: 500,
		{1, 1, 1, 0, 0}: 5000,
		{1, 1, 1, 0, 1}: 5000,
		{1, 1, 0, 1, 1}: 5000,
		{1, 0, 1, 1, 1}: 5000,
		{0, 1, 1, 1, 1}: 5000,
		{1, 1, 1, 1, 1}: math.MaxInt,
	}
	// 用[6]int就可以表示的局势
	ShapeScoreList6 = map[[6]int]int{
		{0, 1, 0, 1, 1, 0}: 5000,
		{0, 1, 1, 0, 1, 0}: 5000,
		{0, 1, 1, 1, 1, 0}: 50000,
	}
)
